
Составить программу, которая запрашивает пароль (напри- мер, четырехзначное число) до тех пор, пока он не будет пра- вильно введен
Устанавливаем верный пароль



correct_password = '1234'
while True:
    # Запрашиваем пароль у пользователя
    user_input = input("Введите пароль (четыре цифры): ")
    
    # Проверяем правильность ввода
    if len(user_input) != 4 or not user_input.isdigit():
        print("Ошибка! Пароль должен состоять ровно из 4 цифр.")
        continue
        
    # Сравниваем введенный пароль с правильным
    if user_input == correct_password:
        print("Пароль принят!")
        break
    else:
        print("Неправильный пароль. Попробуйте ещё раз.")
